views/registers/_form.php

?>
</div>
<div class="help-block"></div>
    <?= $form->field($model, 'code')->dropDownList(ArrayHelper::map($code::find()->all(), 'id', "abbreviation"), ['placeholder'=> 'Choose Code'])?>
---
SELECT * FROM `code`