views/registers/_formsearch.php

SELECT * FROM `users`
---

    <?php $form = ActiveForm::begin(); ?>

<?php //$form->field($model, 'organization')->dropDownList(ArrayHelper::map(Users::find()->all(), 'id', "username"), ['placeholder'=> 'Choose Organization'])?>