controllers/RegistersController.php

     public function actionRegistered()
    {
        $reg = new \app\models\Registers;

        $codes = Code::find()->where('code.especial!=1')->all();
        $codesespecial = Code::find()->where('code.especial=1')->all();
---
SELECT * FROM `code` WHERE code.especial!=1
SELECT * FROM `code` WHERE code.especial=1