controllers/RegistersCodeEspecialController.php

    public function actionCreate($extra = false)
    {
        $model = new RegistersCodeEspecial();


        $code = new \app\models\Code;


        $model->create_date = new Expression('NOW()');

        if($model->load(Yii::$app->request->post())) {

            $model->organization =  Yii::$app->user->identity->id;
            $model->date_buy = DateFormat::formatDateEu($model->date_buy);

            if($extra != false)
            {

                $model->extra = $extra;
                $RE = new RegistersExtra;
                $ob = $RE::findOne($extra);

                $ob->restAmount($model->amount);

                $ob->save();

            }

               // var_dump($model->save());
            if($model->save())
---
INSERT INTO `registers_code_especial` (`create_date`, `extract`, `date_buy`, `code`, `process`, `amount`, `organization`) VALUES (NOW(), 87788778, '2014-10-23', 8, 'akahskdhfshdjk', '1222.22', 5)

    protected function findModel($id)
    {
        if (($model = RegistersCodeEspecial::findOne($id)) !== null) {
---
SELECT * FROM `registers_code_especial` WHERE `id`='4'