models/RegistersCodeEspecial.php

SELECT * FROM `code` WHERE `id`=8
---
     public function getAbbreviation()
    {
        //var_dump($this->code);
        //var_dump(Code::findOne($this->code));die();
        return Code::findOne($this->code)->abbreviation;