models/Registers.php

    public function getAbbreviation()
    {
        //var_dump($this->code);
        //var_dump(Code::findOne($this->code));die();
        return Code::findOne($this->code)->abbreviation;
---
SELECT * FROM `code` WHERE `id`=6

    public function getChildName()
    {
         //var_dump($this->child);die();
         return  Children::findOne($this->child)->name;
---
SELECT * FROM `children` WHERE `id`=6

    public function getChildSurname()
    {
         //var_dump($this->child);die();
         return Children::findOne($this->child)->surname;
---
SELECT * FROM `children` WHERE `id`=6

    function getChildrenTotalByValue($month= '')
    {
        $children = $this->getListRegisterByChildrenByCode($month);
        $codes = Code::find()->all();
---
SELECT * FROM `code`