models/Users.php

    public static function findIdentity($id)
    {
        //var_dump(static::findOne($id));die();
        $users = static::findOne($id);
---
SELECT * FROM `users` WHERE `id`=5

     public static function findByUsername($username)
    {
        ///var_dump(\Yii::$app->user->login());die();
        $users = Users::find()->all();
---
SELECT * FROM `users`