views/registers-code-especial/_form.php

SELECT * FROM `code` WHERE code.especial=1
---
</div>
<div class="help-block"></div>

    <?= $form->field($model, 'code')->dropDownList(ArrayHelper::map($code::find()->where('code.especial=1')->all(), 'id', "abbreviation"), ['placeholder'=> 'Choose Code'])?>